Show / Hide Table of Contents
Class ConnectionCheckRes
Results for connection in project
Inheritance
System.Object
ConnectionCheckRes
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Connection
Assembly: IdeaRS.OpenModel.dll
Syntax
[Serializable]
[DataContract]
public class ConnectionCheckRes
Constructors
Improve this Doc   View Source
ConnectionCheckRes()
Declaration
public ConnectionCheckRes()
Properties
Improve this Doc   View Source
ConnectionID
Guid of connection
Declaration
[DataMember]
public Guid ConnectionID { get; set; }
Property Value
 Type |  Description
 System.Guid
Improve this Doc   View Source
CheckResAnchor
List of check results for anchors
Declaration
[DataMember]
public List<CheckResAnchor> CheckResAnchor { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<CheckResAnchor>
Improve this Doc   View Source
CheckResBolt
List of check results for bolts
Declaration
[DataMember]
public List<CheckResBolt> CheckResBolt { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<CheckResBolt>
Improve this Doc   View Source
CheckResConcreteBlock
List of check results for concrete blocks
Declaration
[DataMember]
public List<CheckResConcreteBlock> CheckResConcreteBlock { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<CheckResConcreteBlock>
Improve this Doc   View Source
CheckResPlate
List of check results for plates
Declaration
[DataMember]
public List<CheckResPlate> CheckResPlate { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<CheckResPlate>
Improve this Doc   View Source
CheckResSummary
List of CheckResSummary
Declaration
[DataMember]
public List<CheckResSummary> CheckResSummary { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<CheckResSummary>
Improve this Doc   View Source
CheckResWeld
List of check results for welds
Declaration
[DataMember]
public List<CheckResWeld> CheckResWeld { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<CheckResWeld>
Improve this Doc   View Source
Messages
Gets or sets the list of errors, that apears during validation and/or calculation.
Declaration
[DataMember]
public OpenMessages Messages { get; set; }
Property Value
 Type |  Description
 OpenMessages
Improve this Doc   View Source
Name
Name of connection
Declaration
[DataMember]
public string Name { get; set; }
Property Value
 Type |  Description
 System.String
 Improve this Doc
 View Source